In [45]:
from sqlalchemy import create_engine

In [46]:
engine = create_engine('sqlite:///foo.db')

In [47]:
import numpy as np
import pandas as pd

frame = pd.DataFrame(
    np.arange(20).reshape(4, 5),
    columns=['white', 'red', 'blue', 'black', 'green']
)
frame

   white  red  blue  black  green
0      0    1     2      3      4
1      5    6     7      8      9
2     10   11    12     13     14
3     15   16    17     18     19

In [48]:
frame.to_sql('frame_table', engine)

4

In [49]:
pd.read_sql('frame_table', engine)

   index  white  red  blue  black  green
0      0      0    1     2      3      4
1      1      5    6     7      8      9
2      2     10   11    12     13     14
3      3     15   16    17     18     19

In [50]:
import sqlite3

# створення таблиці
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);
"""
con = sqlite3.connect(':memory:')
con.execute(query)
con.commit()

# вставка даних
data = [
    ('white', 'up',   1, 3),
    ('black', 'down', 2, 8),
    ('green', 'up',   4, 4),
    ('red',   'down', 5, 5)
]
stmt = "INSERT INTO test VALUES(?,?,?,?)"
con.executemany(stmt, data)
con.commit()

# вибірка
cursor = con.execute('SELECT * FROM test')
rows = cursor.fetchall()
rows
# [('white', 'up', 1.0, 3), ('black', 'down', 2.0, 8), ...]

[('white', 'up', 1.0, 3),
 ('black', 'down', 2.0, 8),
 ('green', 'up', 4.0, 4),
 ('red', 'down', 5.0, 5)]

In [51]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [52]:
# connect to postgres database using sqlalchemy
postgres_engine = create_engine("postgresql://user:pass@localhost:5432/postgres")

In [54]:
frame = pd.DataFrame(
    np.random.random((4, 4)),
    index=['exp1', 'exp2', 'exp3', 'exp4'],
    columns=['feb', 'mar', 'apr', 'may']
)

frame.to_sql('dataframe', postgres_engine)

4

In [55]:
pd.read_sql('dataframe', postgres_engine)

  index       feb       mar       apr       may
0  exp1  0.540955  0.240932  0.315204  0.858070
1  exp2  0.636124  0.823546  0.701656  0.139284
2  exp3  0.880958  0.616621  0.826308  0.140411
3  exp4  0.670557  0.195150  0.610043  0.005413

In [56]:
pd.read_sql_query('SELECT index,apr,may FROM DATAFRAME WHERE apr > 0.5', postgres_engine)

  index       apr       may
0  exp2  0.701656  0.139284
1  exp3  0.826308  0.140411
2  exp4  0.610043  0.005413

## NoSQL databases (MongoDB)

In [57]:
from pymongo import MongoClient
client = MongoClient('localhost', 27017)

In [58]:
db = client.mydatabase
db = client['mydatabase']

In [59]:
collection = db.mycollection

In [60]:
import pandas as pd, numpy as np, json

frame = pd.DataFrame(
    np.arange(20).reshape(4, 5),
    columns=['white', 'red', 'blue', 'black', 'green']
)

frame

   white  red  blue  black  green
0      0    1     2      3      4
1      5    6     7      8      9
2     10   11    12     13     14
3     15   16    17     18     19

In [61]:
json_df = frame.T.to_json()
json_df

'{"0":{"white":0,"red":1,"blue":2,"black":3,"green":4},"1":{"white":5,"red":6,"blue":7,"black":8,"green":9},"2":{"white":10,"red":11,"blue":12,"black":13,"green":14},"3":{"white":15,"red":16,"blue":17,"black":18,"green":19}}'

In [62]:
record = json.loads(json_df).values()
record

dict_values([{'white': 0, 'red': 1, 'blue': 2, 'black': 3, 'green': 4}, {'white': 5, 'red': 6, 'blue': 7, 'black': 8, 'green': 9}, {'white': 10, 'red': 11, 'blue': 12, 'black': 13, 'green': 14}, {'white': 15, 'red': 16, 'blue': 17, 'black': 18, 'green': 19}])

In [63]:
collection.mydocument.insert_many(record)

InsertManyResult([ObjectId('6890f3937ed9c0063100a134'), ObjectId('6890f3937ed9c0063100a135'), ObjectId('6890f3937ed9c0063100a136'), ObjectId('6890f3937ed9c0063100a137')], acknowledged=True)

In [64]:
result = collection['mydocument'].find()
df = pd.DataFrame(list(result))
df

                        _id  white  red  blue  black  green
0  6890f3937ed9c0063100a134      0    1     2      3      4
1  6890f3937ed9c0063100a135      5    6     7      8      9
2  6890f3937ed9c0063100a136     10   11    12     13     14
3  6890f3937ed9c0063100a137     15   16    17     18     19

In [65]:
del df['_id']
df

   white  red  blue  black  green
0      0    1     2      3      4
1      5    6     7      8      9
2     10   11    12     13     14
3     15   16    17     18     19

In [66]:
result = collection['mydocument'].find({"white": {"$gt": 5}})
df = pd.DataFrame(list(result))
df

                        _id  white  red  blue  black  green
0  6890f3937ed9c0063100a136     10   11    12     13     14
1  6890f3937ed9c0063100a137     15   16    17     18     19